Revit 2027 API
FabricationPart.IsAStraight Method
 Checks whether it is a straight part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAStraight()
Public Function IsAStraight As Boolean
public:
bool IsAStraight()
member IsAStraight : unit -> bool
Return Value
Boolean
 True if the part is a straight part. False otherwise.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace